app/controllers/users_controller.rb

    def create
        @user = User.new(username: params[:username], email: params[:email], password: params[:password])

        if @user.save
---
INSERT INTO "users" ("username", "email", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["username", "dasileker"], ["email", "zerradi.amine@hotmail.com"], ["password", "19900813"], ["created_at", "2020-12-09 11:21:14.450708"], ["updated_at", "2020-12-09 11:21:14.450708"]]